test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A demo website</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">A demo website
<br />
<span class="subtitle">Testing read the org</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org254d2ec">1. Start</a>
<ul>
<li><a href="#org13ec8f5">1.1. Subtitle</a></li>
<li><a href="#orgbb08e0c">1.2. Powershell</a></li>
<li><a href="#orgee78ef1">1.3. sh</a></li>
</ul>
</li>
<li><a href="#orgdc58158">2. Another part of it</a>
<ul>
<li><a href="#orga39cc33">2.1. Quote</a></li>
<li><a href="#org26d1d85">2.2. Example</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org254d2ec" class="outline-2">
<h2 id="org254d2ec"><span class="section-number-2">1.</span> Start</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org13ec8f5" class="outline-3">
<h3 id="org13ec8f5"><span class="section-number-3">1.1.</span> Subtitle</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Some scripts
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">bootstrap-version</span>)
(<span style="font-weight: bold;">let</span> ((bootstrap-file
       (expand-file-name <span style="font-style: italic;">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory))
      (bootstrap-version 5))
  (<span style="font-weight: bold;">unless</span> (file-exists-p bootstrap-file)
    (<span style="font-weight: bold;">with-current-buffer</span>
        (url-retrieve-synchronously
         <span style="font-style: italic;">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessag
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb08e0c" class="outline-3">
<h3 id="orgbb08e0c"><span class="section-number-3">1.2.</span> Powershell</h3>
<div class="outline-text-3" id="text-1-2">
<p>
And another script
</p>
<div class="org-src-container">
<pre class="src src-powershell">Function refreshenv {
		$paths = @(
				([System.Environment]::GetEnvironmentVariable("Path","Machine") -split ";")
				([System.Environment]::GetEnvironmentVariable("Path","User") -split ";")
		)
		$env:path = ($paths|Select-Object -Unique) -join ";"
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgee78ef1" class="outline-3">
<h3 id="orgee78ef1"><span class="section-number-3">1.3.</span> sh</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Some sh code.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold;">for</span> i<span style="font-weight: bold;"> in</span> /etc/init.d/*
<span style="font-weight: bold;">do</span>
    <span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">i</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdc58158" class="outline-2">
<h2 id="orgdc58158"><span class="section-number-2">2.</span> Another part of it</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga39cc33" class="outline-3">
<h3 id="orga39cc33"><span class="section-number-3">2.1.</span> Quote</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is <i>italic</i> with some <b>bold</b> and <code>code format</code> and <code>tilde format</code>
</p>
<blockquote>
<p>
Some die young.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org26d1d85" class="outline-3">
<h3 id="org26d1d85"><span class="section-number-3">2.2.</span> Example</h3>
<div class="outline-text-3" id="text-2-2">
<p>
For reference.
</p>
<pre class="example" id="orgd8ca2b1">
Some text in example format.
Another line.
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
